"Part1" = "BAHASA INDONESIA";
"Part2" = "APPLE INC. ";
"Part3" = "PERJANJIAN LISENSI PERANGKAT LUNAK PINTASAN UNTUK iOS";
"Part4" = "BACALAH PERJANJIAN LISENSI PERANGKAT LUNAK INI (“LISENSI”) DENGAN TELITI SEBELUM MENGGUNAKAN PERANGKAT LUNAK APPLE. DENGAN MENGGUNAKAN PERANGKAT LUNAK APPLE, ANDA SETUJU UNTUK TERIKAT OLEH KETENTUAN-KETENTUAN LISENSI INI. JIKA ANDA TIDAK MENYETUJUI KETENTUAN-KETENTUAN LISENSI INI, JANGAN MEMASANG DAN/ATAU MENGGUNAKAN PERANGKAT LUNAK TERSEBUT.";
"Part5" = "CATATAN PENTING: Sepanjang perangkat lunak ini dapat digunakan untuk memperbanyak, memodifikasi, menerbitkan dan mendistribusikan materi-materi, perangkat lunak tersebut dilisensikan kepada anda hanya untuk memperbanyak, memodifikasi, menerbitkan dan mendistribusikan materi-materi yang tidak dilindungi oleh hak cipta, materi-materi yang hak ciptanya anda miliki, atau materi-materi yang mana anda berwenang atau secara sah diizinkan untuk memperbanyak, memodifikasi, menerbitkan atau mendistribusikannya. Jika anda ragu-ragu tentang hak anda untuk menyalin, memodifikasi, menerbitkan atau mendistribusikan setiap materi, sebaiknya anda menghubungi penasihat hukum anda.";
"Part6" = "1. Umum. ";
"Part7" = "A. Perangkat lunak Apple, dan setiap perangkat lunak pihak ketiga, dokumentasi, antarmuka-antarmuka, konten, huruf-huruf dan data apapun yang menyertai Lisensi ini baik dalam bentuk memori baca-saja (read-only memory), dalam media apapun lainnya atau dalam bentuk apapun lainnya (secara bersama-sama “Perangkat Lunak Apple”) dilisensikan, namun tidak dijual, kepada anda oleh Apple Inc. (“Apple”) hanya untuk penggunaan yang berdasarkan ketentuan-ketentuan Lisensi ini. Apple dan/atau para pemberi lisensi Apple tetap mempertahankan kepemilikan atas Perangkat Lunak Apple itu sendiri dan tetap memiliki semua hak yang tidak secara tegas diberikan kepada anda. ";
"Part8" = "B. Apple, atas diskresinya, dapat menyediakan peningkatan atau pemutakhiran lebih lanjut terhadap Perangkat Lunak Apple untuk perangkat iOS bermerek Apple yang kompatibel milik anda. Peningkatan dan pemutakhiran Perangkat Lunak Apple, apabila ada, tidak harus mencakup seluruh fitur-fitur perangkat lunak yang sudah ada atau fitur-fitur baru yang dikeluarkan oleh Apple untuk model-model terbaru atau model-model lainnya dari perangkat iOS. Ketentuan-ketentuan Lisensi ini akan mengatur setiap peningkatan atau pemutakhiran perangkat lunak yang diberikan oleh Apple pada produk Perangkat Lunak Apple yang asli, kecuali peningkatan atau pemutakhiran tersebut dilengkapi dengan suatu lisensi terpisah yang dalam hal apapun anda menyetujui bahwa ketentuan-ketentuan dari lisensi tersebut akan mengatur peningkatan atau pemutakhiran tersebut. ";
"Part9" = "2. Penggunaan-Penggunaan dan Pembatasan-Pembatasan Lisensi Yang Diizinkan. ";
"Part10" = "A. Lisensi. Dengan tunduk pada ketentuan-ketentuan dan syarat-syarat Lisensi ini dan sebagaimana diperkenankan oleh “Aturan-aturan Pemakaian Layanan-layanan dan Konten” yang diatur dalam Ketentuan-ketentuan dan Syarat-syarat Layanan Media Apple (https://www.apple.com/legal/internet-services/itunes/) (“Aturan-Aturan Pemakaian”), kecuali anda memperoleh Perangkat Lunak Apple sebagaimana dijelaskan pada Bagian 2B, anda diberikan suatu lisensi yang terbatas, tidak eksklusif dan tidak dapat dialihkan untuk memasang dan menggunakan Perangkat Lunak Apple pada setiap perangkat iOS bermerek Apple yang kompatibel yang anda miliki atau kuasai. Anda tidak boleh mendistribusikan atau menyediakan Perangkat Lunak Apple melalui suatu jaringan yang memungkinkan untuk dapat digunakan oleh beberapa perangkat pada saat yang sama. Anda tidak boleh menyewa, menyewakan, meminjamkan, menjual, mendistribusikan kembali, atau memberikan lisensi kembali Perangkat Lunak Apple.  ";
"Part11" = "B. Lisensi Volume atau Lisensi Pemeliharaan. Jika anda memperoleh Perangkat Lunak Apple berdasarkan suatu program lisensi volume atau program lisensi pemeliharaan dengan Apple, ketentuan-ketentuan lisensi volume atau lisensi pemeliharaan anda akan menentukan jumlah salinan dari Perangkat Lunak Apple yang diizinkan untuk diunduh, dipasang, digunakan dan dijalankan oleh anda pada perangkat-perangkat iOS bermerek Apple yang anda miliki atau kuasai. Kecuali disetujui secara tertulis oleh Apple, semua ketentuan dan syarat lain dari Lisensi ini akan berlaku terhadap penggunaan Perangkat Lunak Apple oleh anda yang diperoleh berdasarkan suatu lisensi volume atau lisensi pemeliharaan.";
"Part12" = "C. Persyaratan Sistem. Perangkat Lunak Apple hanya didukung pada perangkat keras bermerek Apple yang memenuhi persyaratan sistem tertentu sebagaimana diindikasikan oleh Apple.";
"Part13" = "D. Konten dan Materi-Materi Digital. Alas hak dan hak-hak kekayaan intelektual dalam dan terhadap setiap konten, termasuk merek, logo dan gambar, yang ditampilkan oleh atau diakses melalui Perangkat Lunak Apple merupakan milik pemilik konten yang bersangkutan. Konten tersebut mungkin dilindungi oleh hak cipta, merek atau hukum dan perjanjian kekayaan intelektual lainnya, dan mungkin dikenakan ketentuan-ketentuan penggunaan pihak ketiga yang menyediakan konten tersebut. Kecuali ditentukan lain dalam Lisensi ini, (i) Lisensi ini tidak memberikan hak-hak apapun kepada anda untuk menggunakan konten tersebut dan tidak menjamin bahwa konten tersebut akan terus tersedia bagi anda dan (ii) anda tidak dapat menggunakan, mengambil atau mendistribusikan, secara komersial atau dengan cara lain, secara berdiri sendiri, setiap foto, logo, teks, kode, gambar, grafis, karya seni, audio, video atau aset-aset sejenis (“Materi-Materi Digital”) yang terkandung dalam, atau diberikan sebagai bagian dari, Perangkat Lunak Apple, atau dengan cara lain menggunakan Materi-Materi Digital di luar konteks penggunaan yang dimaksudkannya sebagai bagian dari Perangkat Lunak Apple.";
"Part14" = "E. Penggunaan Pintasan. Anda mengakui bahwa semua pintasan aksi di aplikasi dan/atau situs web (“Pintasan”) merupakan tanggung jawab penuh dari pihak atau pihak-pihak dari siapa Pintasan tersebut berasal. Apple tidak mempunyai kendali atas, dan tidak memikul tanggung jawab atas, konten atau fungsi dari Pintasan apapun milik pihak ketiga. Anda menggunakan Pintasan apapun atas risiko anda sendiri dan anda bertanggung jawab sendiri atas kepatuhan anda terhadap persyaratan atau perjanjian pihak ketiga yang timbul dari penggunaan Pintasan apapun oleh anda. Anda mengakui bahwa Apple tidak mempunyai kewajiban untuk terlebih dahulu menyaring Pintasan, meskipun Apple berhak atas diskresinya sendiri untuk terlebih dahulu menyaring, menolak, menonaktifkan atau memutus Pintasan.";
"Part15" = "F. Berbagi Pintasan. Perangkat Lunak Apple dapat memperkenankan anda untuk berbagi Pintasan ciptaan anda dengan orang lain via suatu tautan web. Pintasan berbagi milik anda, berikut dengan konten apapun yang tertanam di dalamnya, akan disimpan di server-server Apple untuk tujuan memperbolehkan berbagi tersebut dan dapat digunakan untuk memperbaiki produk-produk dan layanan-layanan Apple secara umum. Pintasan berbagi milik anda, berikut dengan konten apapun yang tertanam di dalamnya, akan disediakan kepada setiap orang yang memiliki akses ke tautan web, yang kemudian dapat menyalin, menyimpan, memodifikasi dan mendistribusikan kembali salinan dari Pintasan milik anda dan semua konten yang tertanam di dalamnya. Dengan berbagi suatu Pintasan, anda menyatakan bahwa: (1) anda mempunyai semua hak dan lisensi yang diperlukan atas Pintasan tersebut dan bahwa hak dan lisensi tersebut tidak akan menyalahi atau melanggar hak-hak pihak lain manapun; dan (2) Pintasan apapun yang anda bagi tidak akan melanggar hukum apapun, menyebabkan atau mendorong pelanggaran atau perilaku yang melanggar hukum lainnya, atau menjadi tidak senonoh atau tidak pantas. Anda mengakui bahwa Apple tidak mempunyai kewajiban untuk meninjau kembali Pintasan apapun yang anda bagi, meskipun Apple berhak atas diskresinya sendiri untuk meninjau kembali, menonaktifkan atau memutus Pintasan apapun yang anda bagi.";
"Part16" = "G. Larangan terhadap Penggunaan. Anda setuju untuk tidak: mengunggah, memasang, mengirimkan surat elektronik, melakukan transmisi, membagi atau dengan cara lain menyediakan Pintasan apapun yang: (1) tidak sah, melawan hukum, mencemarkan, vulgar, tidak senonoh, memfitnah, atau tidak pantas secara rasial, etnis atau lainnya; (2) melanggar, atau mendorong perilaku apapun yang akan melanggar, hukum atau peraturan apapun yang berlaku atau akan menimbulkan kewajiban sipil; (3) mendukung diskriminasi, kefanatikan, rasisme, kebencian, pelecehan atau bahaya terhadap individu atau kelompok manapun; (4) kejam atau mengancam, atau mendukung kekerasan atau tindakan-tindakan yang mengancam orang lain manapun; (5) mendukung kegiatan-kegiatan ilegal atau berbahaya; atau (6) anda ketahui atau yakini salah, menyesatkan, menipu, atau dengan cara apapun membohongi seorang pengguna Pintasan tersebut. Anda lebih lanjut menyetujui untuk tidak mengganggu, mengacaukan, atau menciptakan beban yang tidak semestinya pada server atau jaringan yang terhubung ke Perangkat Lunak Apple atau aplikasi perangkat lunak, layanan-layanan atau situs-situs web apapun milik pihak ketiga pada perangkat iOS anda (“Aplikasi Pihak Ketiga”) atau melanggar peraturan, kebijakan atau prosedur dari jaringan atau Aplikasi Pihak Ketiga tersebut.";
"Part17" = "H. Aplikasi Pihak Ketiga. Untuk melengkapi Pintasan tertentu, Perangkat Lunak Apple mungkin perlu mengakses Aplikasi Pihak Ketiga. Anda secara tegas menyetujui dan mengizinkan Perangkat Lunak Apple untuk mengakses dan menggunakan Aplikasi Pihak Ketiga ini atas nama anda sepanjang diperlukan untuk melengkapi Pintasan dengan Perangkat Lunak Apple. Sepanjang Perangkat Lunak Apple mengakses Aplikasi Pihak Ketiga apapun, Apple tidak memiliki kewajiban tersurat maupun tersirat untuk memberikan bantuan teknis atau bantuan lain apapun bagi Aplikasi Pihak Ketiga tersebut. Silakan hubungi langsung penjual, pembuat atau penyedia jasa perangkat lunak yang tepat untuk bantuan teknis dan layanan konsumen berkenaan dengan perangkat lunak, layanan, situs web dan/atau produk-produknya. SELANJUTNYA ANDA SETUJU BAHWA ANDA AKAN TERIKAT OLEH, DAN SETUJU UNTUK MEMATUHI, SEMUA KETENTUAN LAYANAN ATAU PERJANJIAN-PERJANJIAN LAINNYA YANG BERLAKU BAGI APLIKASI PIHAK KETIGA TERSEBUT KETIKA MENGGUNAKAN PERANGKAT LUNAK APPLE. ANDA SEPENUHNYA BERTANGGUNG JAWAB UNTUK MEMASTIKAN BAHWA SEMUA PINTASAN MEMATUHI KETENTUAN-KETENTUAN YANG BERLAKU UNTUK MASING-MASING APLIKASI PIHAK KETIGA YANG DIGUNAKAN OLEH PINTASAN. APPLE TIDAK MENJAMIN DENGAN CARA APAPUN BAHWA PINTASAN MEMATUHI KETENTUAN-KETENTUAN UNTUK APLIKASI PIHAK KETIGA DAN APPLE TIDAK BERTANGGUNG JAWAB ATAS PINTASAN PIHAK KETIGA.";
"Part18" = "I. Tidak Ada Rekayasa Balik. Anda tidak boleh, dan anda setuju untuk tidak atau memperbolehkan orang lain untuk, menyalin (kecuali sebagaimana secara tegas diperkenankan oleh Lisensi ini atau oleh Aturan-Aturan Pemakaian jika Aturan-Aturan Pemakaian berlaku terhadap anda), merombak, merekayasa balik, membongkar, mencoba untuk menemukan kode sumber dari, mengurai sandi, mengubah, atau menciptakan karya-karya turunan dari Perangkat Lunak Apple atau layanan-layanan apapun yang disediakan oleh Perangkat Lunak Apple, atau setiap bagian daripadanya (kecuali sebagaimana dan hanya sepanjang pembatasan tersebut di atas dilarang oleh hukum yang berlaku atau sejauh yang mungkin diizinkan oleh persyaratan pemberian lisensi yang mengatur penggunaan komponen-komponen sumber terbuka yang disertakan dengan Perangkat Lunak Apple).";
"Part19" = "J. Kepatuhan terhadap Hukum. Anda setuju untuk menggunakan Perangkat Lunak Apple dan Layanan-Layanan (sebagaimana didefinisikan dalam Bagian 4 di bawah ini) dengan mematuhi semua hukum yang berlaku, termasuk hukum setempat dari negara atau wilayah di mana anda tinggal atau di mana anda mengunduh atau menggunakan Perangkat Lunak Apple dan Layanan-Layanan.";
"Part20" = "K. Pemutakhiran Otomatis. Jika anda memilih untuk memperbolehkan pemutakhiran aplikasi otomatis, perangkat anda akan secara berkala mengecek dengan Apple peningkatan dan pemutakhiran terhadap Perangkat Lunak Apple dan, jika suatu peningkatan atau pemutakhiran tersedia, peningkatan atau pemutakhiran tersebut secara otomatis akan terunduh dan terpasang pada perangkat anda dan, apabila berlaku, pada perangkat periferal anda. Anda dapat menonaktifkan pemutakhiran aplikasi otomatis semuanya sewaktu-waktu dengan mengubah pengaturan pemutakhiran aplikasi otomatis yang ditemukan di dalam Pengaturan.";
"Part21" = "3. Persetujuan terhadap Penggunaan Data. ";
"Part22" = "A. Data Analitis. Jika anda memilih koleksi Analitis, anda setuju bahwa Apple dan anak-anak perusahaan serta agen-agennya dapat mengumpulkan, menyimpan, memproses dan menggunakan informasi diagnostik, teknis, pemakaian dan yang berhubungan dengannya, termasuk namun tidak terbatas pada pengenal sistem atau pengenal perangkat lunak yang unik, informasi mengenai perangkat iOS, komputer, sistem dan aplikasi perangkat lunak, dan peralatan anda, yang dikumpulkan secara berkala untuk memberikan dan memperbaiki produk-produk dan layanan-layanan Apple, untuk memudahkan penyediaan pemutakhiran-pemutakhiran perangkat lunak, produk pendukung dan layanan-layanan lainnya untuk anda (apabila ada) yang berkaitan dengan Perangkat Lunak Apple, dan untuk memastikan kepatuhan terhadap ketentuan-ketentuan Lisensi ini. Apple dapat menggunakan informasi ini, sepanjang dikumpulkan dalam suatu bentuk yang tidak mengidentifikasikan anda secara pribadi, untuk maksud-maksud yang dijelaskan di atas. Agar para mitra Apple dan para pengembang pihak ketiga dapat memperbaiki perangkat lunak, perangkat keras dan layanan-layanan mereka yang dirancang untuk digunakan dengan produk-produk Apple, Apple dapat juga memberikan kepada mitra atau pengembang pihak ketiga tersebut suatu pemisahan informasi diagnostik yang relevan dengan perangkat lunak, perangkat keras dan/atau layanan-layanan milik mitra atau pengembang tersebut, sepanjang informasi diagnostik tersebut berada dalam bentuk yang tidak mengidentifikasikan anda secara pribadi.";
"Part23" = "B. Data Lokasi. Apple dan mitra-mitranya, para penerima lisensinya dan para pengembang pihak ketiganya dapat memberikan layanan-layanan tertentu melalui Perangkat Lunak Apple yang bergantung pada informasi lokasi. Untuk memberikan dan memperbaiki layanan-layanan ini, apabila tersedia, Apple dan mitra-mitranya, para penerima lisensinya dan para pengembang pihak ketiganya dapat mengirimkan, mengumpulkan, menyimpan, memproses dan menggunakan data lokasi anda. Data dan informasi lokasi yang dikumpulkan oleh Apple dikumpulkan dalam suatu bentuk yang tidak mengidentifikasikan anda secara pribadi dan dapat dipergunakan oleh Apple dan mitra-mitranya, para penerima lisensinya dan para pengembang pihak ketiganya untuk memberikan dan memperbaiki produk-produk dan layanan-layanan yang berbasis lokasi. Dengan menggunakan layanan-layanan berbasis lokasi yang disediakan oleh atau melalui Perangkat Lunak Apple, anda menyetujui dan mengizinkan transmisi, pengumpulan, penyimpanan, pemrosesan dan penggunaan data dan informasi lokasi anda oleh Apple dan mitra-mitranya, para penerima lisensinya dan para pengembang pihak ketiganya untuk memberikan dan memperbaiki produk-produk dan layanan-layanan tersebut. Anda boleh menarik kembali persetujuan ini setiap saat dengan cara mengakses ke pengaturan Layanan-Layanan Lokasi pada perangkat iOS anda dan baik dengan menonaktifkan pengaturan Layanan-Layanan Lokasi global ataupun menonaktifkan pengaturan lokasi individu pada Perangkat Lunak Apple. Ketika menggunakan aplikasi-aplikasi atau layanan-layanan milik pihak ketiga pada perangkat iOS yang menggunakan atau menyediakan data lokasi, anda akan tunduk pada dan harus membaca ketentuan-ketentuan dan kebijakan privasi pihak ketiga tersebut mengenai penggunaan data lokasi dengan aplikasi-aplikasi atau layanan-layanan pihak ketiga tersebut.";
"Part24" = "C. Kebijakan Privasi. Dari waktu ke waktu informasi anda akan diperlakukan sesuai dengan Kebijakan Privasi Apple, yang dapat dilihat di: https://www.apple.com/legal/privacy/.";
"Part25" = "4. Layanan-Layanan dan Materi-Materi Pihak Ketiga.";
"Part26" = "A. Umum. Perangkat Lunak Apple dapat memungkinkan akses ke Toko iTunes, Toko App, iCloud, Maps milik Apple dan layanan-layanan dan situs-situs web lain milik Apple dan pihak ketiga (secara bersama-sama dan masing-masing, “Layanan-Layanan”). Layanan-Layanan tersebut mungkin tidak tersedia dalam semua bahasa atau di semua negara. Penggunaan Layanan-Layanan ini memerlukan akses Internet dan penggunaan Layanan-Layanan tertentu mungkin memerlukan suatu ID Apple, mungkin mengharuskan anda untuk menerima ketentuan-ketentuan tambahan dan mungkin dikenakan biaya-biaya tambahan. Dengan menggunakan perangkat lunak ini dalam kaitannya dengan suatu akun Toko iTunes, ID Apple atau Layanan Apple lainnya, anda menyetujui ketentuan-ketentuan layanan yang berlaku untuk Layanan tersebut, seperti Ketentuan-Ketentuan dan Syarat-Syarat Layanan Media Apple terkini yang dapat anda akses dan temukan di https://www.apple.com/legal/internet-services/itunes/.";
"Part27" = "B. Jika anda memilih untuk menggunakan layanan-layanan iCloud melalui Perangkat Lunak Apple, penggunaan tersebut tunduk pada ketentuan-ketentuan tambahan berikut ini: Ketentuan-Ketentuan dan Syarat-Syarat iCloud tersedia di https://www.apple.com/legal/internet-services/icloud/ dan Kebijakan Privasi Apple tersedia di https://www.apple.com/legal/privacy/.";
"Part28" = "C. Anda memahami bahwa dengan menggunakan suatu Layanan, anda dapat menemukan konten yang dapat dianggap sebagai ofensif, tidak layak, atau tidak dapat diterima, di mana konten tersebut dapat atau tidak dapat diidentifikasikan sebagai mengandung bahasa yang eksplisit. Namun demikian, anda setuju untuk menggunakan Layanan-Layanan atas risiko anda sendiri dan bahwa Apple tidak bertanggung jawab kepada anda atas konten yang dianggap sebagai ofensif, tidak layak, atau tidak dapat diterima.";
"Part29" = "D. Layanan-Layanan tertentu dapat menyajikan, mencakup atau menyediakan layanan-layanan, konten, data, informasi, aplikasi-aplikasi atau materi-materi dari pihak-pihak ketiga (“Materi-Materi Pihak Ketiga”) atau menyediakan tautan-tautan ke situs-situs web atau aplikasi-aplikasi tertentu milik pihak ketiga. Dengan menggunakan Layanan-Layanan, anda mengakui dan menyetujui bahwa Apple tidak bertanggung jawab untuk memeriksa atau mengevaluasi konten, ketepatan, kelengkapan, ketepatan-waktu, keabsahan, dipatuhinya hak cipta, legalitas, kesopanan, kualitas atau aspek apapun lainnya dari Materi-Materi Pihak Ketiga, aplikasi-aplikasi atau situs-situs web pihak ketiga tersebut. Apple, para pengurusnya, para afiliasinya dan anak-anak perusahaannya tidak menjamin atau mendukung dan tidak menanggung dan tidak akan memikul kewajiban atau tanggung jawab apapun kepada anda atau kepada orang lain manapun atas Layanan-Layanan pihak ketiga, Materi-Materi Pihak Ketiga, aplikasi-aplikasi atau situs-situs web pihak ketiga, atau atas materi-materi, produk-produk, atau layanan-layanan lainnya dari pihak-pihak ketiga. Materi-Materi Pihak Ketiga dan tautan-tautan ke situs-situs web atau aplikasi-aplikasi yang lain disediakan semata-mata untuk kemudahan anda.";
"Part30" = "E. Sepanjang anda mengunggah konten apapun melalui penggunaan Layanan-Layanan, anda menyatakan bahwa anda memiliki semua hak atas, atau mempunyai kewenangan atau dengan cara apapun diizinkan oleh hukum untuk mengunggah, konten tersebut dan bahwa konten tersebut tidak melanggar ketentuan-ketentuan layanan yang berlaku terhadap Layanan-Layanan. Anda setuju bahwa Layanan-Layanan memuat konten, informasi dan materi hak kepemilikan, termasuk namun tidak terbatas pada Materi-materi Digital, yang dimiliki oleh Apple, pemilik situs dan/atau para pemberi lisensi mereka, dan yang dilindungi oleh hukum-hukum kekayaan intelektual dan hukum-hukum lain yang berlaku, termasuk namun tidak terbatas pada hak cipta. Anda setuju bahwa anda tidak akan menggunakan konten, informasi atau materi hak kepemilikan tersebut selain untuk penggunaan Layanan-Layanan yang diizinkan atau dengan cara apapun yang tidak sesuai dengan ketentuan-ketentuan Lisensi ini atau yang melanggar hak-hak kekayaan intelektual pihak ketiga atau Apple. Tidak ada bagian dari Layanan-Layanan yang boleh diperbanyak dalam bentuk apapun atau dengan cara apapun. Anda setuju untuk tidak memodifikasi, menyewa, menyewakan, meminjamkan, menjual, mendistribusikan, atau menciptakan karya-karya turunan berdasarkan Layanan-Layanan, dengan cara apapun, dan anda tidak boleh menggunakan Layanan-Layanan dengan cara apapun yang tidak diizinkan, termasuk namun tidak terbatas pada, penggunaan Layanan-Layanan untuk mentransmisikan virus komputer, worms, kuda trojan, atau perangkat perusak lainnya, atau dengan melanggar atau membebani kapasitas jaringan. Anda lebih lanjut setuju untuk tidak menggunakan Layanan-Layanan dengan cara apapun untuk mengganggu, melecehkan, menguntit, mengancam, mencemarkan nama baik atau dengan cara lain mengganggu atau melanggar hak-hak pihak lain, dan bahwa Apple sama sekali tidak bertanggung jawab atas penggunaan tersebut oleh anda, atau atas pesan-pesan atau transmisi-transmisi yang bersifat pelecehan, ancaman, pencemaran nama baik, penghinaan, gangguan atau pelanggaran hukum yang mungkin anda terima sebagai akibat dari penggunaan Layanan-Layanan manapun.";
"Part31" = "F. Selain itu, Layanan-Layanan dan Materi-Materi Pihak Ketiga yang dapat diakses dari, dihubungkan ke atau ditampilkan melalui Perangkat Lunak Apple tidak tersedia dalam semua bahasa atau di semua negara atau wilayah. Apple tidak membuat pernyataan bahwa Layanan-Layanan atau Materi-Materi Pihak Ketiga tersebut cukup memadai atau tersedia untuk digunakan di suatu lokasi khusus. Sepanjang anda memilih untuk menggunakan atau mengakses Layanan-Layanan dan Materi-Materi Pihak Ketiga tersebut, anda melakukannya atas inisiatif anda sendiri dan bertanggung jawab atas kepatuhan terhadap hukum-hukum yang berlaku, termasuk akan tetapi tidak terbatas pada hukum-hukum setempat dan hukum-hukum mengenai privasi dan pengumpulan data yang berlaku. Apple dan para pemberi lisensinya berhak untuk mengubah, menangguhkan, menghilangkan, atau memutuskan akses ke suatu Layanan setiap saat tanpa pemberitahuan. Dalam keadaan bagaimanapun Apple tidak akan bertanggung jawab atas dihilangkannya atau diputuskannya akses ke suatu Layanan tersebut. Apple juga dapat menetapkan pembatasan atas pemakaian dari atau akses ke Layanan-Layanan tertentu, dalam setiap hal dan tanpa pemberitahuan atau tanggung jawab.";
"Part32" = "5. Pemutusan. Lisensi ini berlaku hingga diakhiri. Hak-hak anda berdasarkan Lisensi ini akan berakhir secara otomatis atau dengan cara lain berhenti berlaku tanpa pemberitahuan dari Apple apabila anda gagal mematuhi ketentuan(-ketentuan) apapun dari Lisensi ini. Setelah pemutusan Lisensi ini, anda harus menghentikan semua penggunaan Perangkat Lunak Apple dan menghancurkan semua salinan, baik seluruhnya ataupun sebagian, dari Perangkat Lunak Apple. Bagian-Bagian 2I, 3, 4, 5, 6, 7, 8, 10 dan 11 Lisensi ini akan tetap berlaku setelah pemutusan tersebut.";
"Part33" = "6. Pernyataan Tidak Berlakunya Jaminan-Jaminan. ";
"Part34" = "A. Jika anda seorang pelanggan yang merupakan seorang konsumen (seseorang yang menggunakan Perangkat Lunak Apple di luar usaha, bisnis atau profesi anda), anda mungkin mempunyai hak-hak hukum yang sah di negara domisili anda yang mungkin melarang diberlakukannya pembatasan-pembatasan berikut ini terhadap anda, dan pembatasan-pembatasan tersebut tidak akan berlaku terhadap anda apabila dilarang. Untuk mengetahui lebih banyak tentang hak-hak konsumen, sebaiknya anda menghubungi organisasi saran konsumen lokal.";
"Part35" = "B. ANDA SECARA TEGAS MENGAKUI DAN MENYETUJUI BAHWA, SEPANJANG DIPERKENANKAN OLEH HUKUM YANG BELAKU, PENGGUNAAN PERANGKAT LUNAK APPLE DAN LAYANAN-LAYANAN APAPUN YANG DILAKUKAN OLEH ATAU DIAKSES MELALUI PERANGKAT LUNAK APPLE ADALAH ATAS RISIKO ANDA SENDIRI DAN BAHWA SELURUH RISIKO SEHUBUNGAN DENGAN KUALITAS, KINERJA, KETEPATAN DAN UPAYA YANG MEMUASKAN ADA PADA ANDA. ";
"Part36" = "C. SEPANJANG SECARA MAKSIMUM DIIZINKAN OLEH HUKUM YANG BERLAKU, PERANGKAT LUNAK APPLE DAN LAYANAN-LAYANAN DISEDIAKAN “SEBAGAIMANA ADANYA” DAN “SEBAGAIMANA TERSEDIA”, DENGAN SEMUA KEKURANGAN DAN TANPA JAMINAN APAPUN, DAN APPLE DAN PARA PEMBERI LISENSI APPLE (SECARA BERSAMA-SAMA DISEBUT SEBAGAI “APPLE” UNTUK MAKSUD-MAKSUD DARI BAGIAN-BAGIAN 6 DAN 7) DENGAN INI MENYATAKAN TIDAK BERLAKUNYA SEMUA JAMINAN DAN PERSYARATAN SEHUBUNGAN DENGAN PERANGKAT LUNAK APPLE DAN LAYANAN-LAYANAN, BAIK SECARA TEGAS, TERSIRAT ATAU MENURUT UNDANG-UNDANG, TERMASUK, NAMUN TIDAK TERBATAS PADA, JAMINAN-JAMINAN YANG BERSIFAT TERSIRAT DAN/ATAU PERSYARATAN-PERSYARATAN TENTANG KELAYAKAN USAHA, KEPUASAN KUALITAS, KETEPATAN UNTUK SUATU TUJUAN KHUSUS, KEAKURATAN, KETENANGAN UNTUK MENIKMATI, DAN TIDAK DILANGGARNYA HAK-HAK PIHAK KETIGA. ";
"Part37" = "D. APPLE TIDAK MENJAMIN BAHWA ANDA TIDAK AKAN MENGALAMI GANGGUAN DALAM MENIKMATI PERANGKAT LUNAK APPLE DAN LAYANAN-LAYANAN, BAHWA FUNGSI-FUNGSI YANG MELEKAT DI DALAM, ATAU LAYANAN-LAYANAN YANG DILAKUKAN ATAU DIBERIKAN OLEH, PERANGKAT LUNAK APPLE AKAN MEMENUHI KEBUTUHAN ANDA, BAHWA OPERASI PERANGKAT LUNAK APPLE ATAU LAYANAN-LAYANAN TIDAK AKAN PERNAH TERGANGGU ATAU BEBAS DARI KESALAHAN, BAHWA LAYANAN-LAYANAN APAPUN AKAN TERUS DISEDIAKAN, BAHWA PERANGKAT LUNAK APPLE ATAU LAYANAN-LAYANAN AKAN DIKOREKSI, ATAU BAHWA PERANGKAT LUNAK APPLE AKAN KOMPATIBEL ATAU BEKERJA DENGAN PERANGKAT LUNAK PIHAK KETIGA, APLIKASI-APLIKASI PIHAK KETIGA ATAU LAYANAN-LAYANAN PIHAK KETIGA. PEMASANGAN PERANGKAT LUNAK APPLE INI DAPAT MEMENGARUHI KETERSEDIAAN DAN KEGUNAAN PERANGKAT LUNAK PIHAK KETIGA, APLIKASI-APLIKASI PIHAK KETIGA ATAU LAYANAN-LAYANAN PIHAK KETIGA SERTA PRODUK-PRODUK DAN LAYANAN-LAYANAN APPLE. ";
"Part38" = "E. ANDA SELANJUTNYA MENGAKUI BAHWA PERANGKAT LUNAK APPLE DAN LAYANAN-LAYANAN TIDAK DIMAKSUDKAN ATAU COCOK UNTUK DIPAKAI DALAM SITUASI-SITUASI ATAU LINGKUNGAN DI MANA KEGAGALAN ATAU KETERLAMBATAN WAKTU DARI, ATAU KESALAHAN ATAU KETIDAKTEPATAN PADA KONTEN, DATA ATAU INFORMASI YANG DIBERIKAN OLEH, PERANGKAT LUNAK APPLE ATAU LAYANAN-LAYANAN DAPAT MENGAKIBATKAN KEMATIAN, CEDERA PRIBADI, ATAU KERUGIAN FISIK ATAU KERUSAKAN LINGKUNGAN YANG PARAH, TERMASUK TANPA PEMBATASAN PENGOPERASIAN FASILITAS NUKLIR, SISTEM NAVIGASI ATAU SISTEM KOMUNIKASI PESAWAT UDARA, KONTROL LALU LINTAS UDARA, SISTEM PENDUKUNG KEHIDUPAN ATAU SISTEM PERSENJATAAN. ";
"Part39" = "F. TIDAK SATU PUN INFORMASI ATAU NASIHAT LISAN ATAU TERTULIS YANG DIBERIKAN OLEH APPLE ATAU PERWAKILAN APPLE YANG BERWENANG DAPAT MENCIPTAKAN SUATU JAMINAN. APABILA PERANGKAT LUNAK APPLE ATAU LAYANAN-LAYANAN TERNYATA CACAT, ANDA MENANGGUNG SELURUH BIAYA PERAWATAN, PERBAIKAN ATAU KOREKSI YANG DIPERLUKAN. BEBERAPA YURISDIKSI TIDAK MENGIZINKAN PENGECUALIAN ATAS JAMINAN-JAMINAN YANG BERSIFAT TERSIRAT ATAU PEMBATASAN-PEMBATASAN MENGENAI HAK-HAK KONSUMEN YANG DIBERIKAN OLEH UNDANG-UNDANG YANG BERLAKU, DENGAN DEMIKIAN PENGECUALIAN DAN PEMBATASAN-PEMBATASAN DI ATAS MUNGKIN TIDAK BERLAKU TERHADAP ANDA.";
"Part40" = "7. Pembatasan Tanggung Jawab. SEPANJANG TIDAK DILARANG OLEH HUKUM YANG BERLAKU, DALAM KEADAAN APAPUN APPLE TIDAK BERTANGGUNG JAWAB ATAS CEDERA PRIBADI, ATAU KERUGIAN APAPUN YANG BERSIFAT INSIDENTAL, KHUSUS, TIDAK LANGSUNG ATAU KONSEKUENSIAL, TERMASUK, TANPA PEMBATASAN, KERUGIAN KARENA KEHILANGAN KEUNTUNGAN, KERUSAKAN ATAU KEHILANGAN DATA, KEGAGALAN DALAM PENGIRIMAN ATAU PENERIMAAN DATA APAPUN, INTERUPSI USAHA ATAU KEHILANGAN ATAU KERUGIAN NIAGA LAINNYA, YANG TIMBUL DARI ATAU BERKAITAN DENGAN PENGGUNAAN OLEH ANDA ATAU KETIDAKMAMPUAN ANDA MENGGUNAKAN PERANGKAT LUNAK APPLE DAN LAYANAN-LAYANAN ATAU SETIAP PERANGKAT LUNAK PIHAK KETIGA ATAU APLIKASI-APLIKASI PIHAK KETIGA BERSAMA-SAMA DENGAN PERANGKAT LUNAK APPLE, BAGAIMANAPUN HAL TERSEBUT TERJADI, TANPA DIPENGARUHI OLEH TEORI PERTANGGUNGJAWABAN (KONTRAK, PERBUATAN MELAWAN HUKUM ATAU LAINNYA) DAN WALAUPUN APPLE TELAH DIBERITAHU TENTANG KEMUNGKINAN KERUGIAN TERSEBUT. BEBERAPA YURISDIKSI TIDAK MENGIZINKAN PENGECUALIAN ATAU PEMBATASAN TANGGUNG JAWAB ATAS CEDERA PRIBADI, ATAU ATAS KERUGIAN INSIDENTAL ATAU KONSEKUENSIAL, DENGAN DEMIKIAN PEMBATASAN INI TIDAK BERLAKU TERHADAP ANDA. Dalam keadaan apapun, jumlah pertanggungjawaban Apple kepada anda untuk semua kerugian (selain dari yang mungkin disyaratkan oleh hukum yang berlaku dalam kasus-kasus yang melibatkan cedera pribadi) tidak melebihi jumlah lima puluh dolar Amerika Serikat ($50.00). Pembatasan-pembatasan tersebut di atas akan berlaku walaupun upaya yang dinyatakan di atas gagal mencapai maksud utamanya.";
"Part41" = "8. Kontrol Ekspor. Anda tidak boleh menggunakan atau dengan cara lain mengekspor atau mengekspor kembali Perangkat Lunak Apple kecuali sebagaimana diizinkan oleh hukum Amerika Serikat atau hukum dari yurisdiksi(-yurisdiksi) di mana Perangkat Lunak Apple diperoleh. Secara khusus, akan tetapi tanpa pembatasan, Perangkat Lunak Apple tidak boleh diekspor atau diekspor kembali (a) ke negara-negara yang diembargo oleh Amerika Serikat atau (b) ke seseorang dalam daftar Warganegara-Warganegara yang Ditunjuk secara Khusus pada Departemen Keuangan Amerika Serikat atau dalam Daftar Orang atau Daftar Badan yang Ditolak pada Departemen Perdagangan Amerika Serikat atau daftar-daftar pihak terlarang lainnya. Dengan menggunakan Perangkat Lunak Apple, anda menyatakan dan menjamin bahwa anda tidak berada di dalam negara-negara atau dalam daftar tersebut. Anda juga setuju bahwa anda tidak akan menggunakan Perangkat Lunak Apple untuk maksud apapun yang dilarang oleh hukum Amerika Serikat, termasuk, tanpa pembatasan, pengembangan, perancangan, pembuatan atau produksi rudal, senjata nuklir, kimia atau biologis.";
"Part42" = "9. Para Pengguna Akhir Pemerintah. Perangkat Lunak Apple berikut dokumentasi yang berkaitan dengannya merupakan “Barang-Barang Komersial”, sebagaimana istilah itu didefinisikan dalam 48 C.F.R. §2.101, yang terdiri dari “Perangkat Lunak Komputer Komersial” dan “Dokumentasi Perangkat Lunak Komputer Komersial”, sebagaimana istilah-istilah tersebut digunakan dalam 48 C.F.R. §12.212 atau 48 C.F.R. §227.7202, sebagaimana diberlakukan. Sesuai dengan 48 C.F.R. §12.212 atau 48 C.F.R. §227.7202-1 sampai dengan 48 C.F.R. §227.7202-4, sebagaimana diberlakukan, Perangkat Lunak Komputer Komersial dan Dokumentasi Perangkat Lunak Komputer Komersial dilisensikan kepada pengguna-pengguna akhir Pemerintah Amerika Serikat (a) hanya sebagai Barang-Barang Komersial dan (b) hanya dengan hak-hak sama yang juga diberikan kepada semua pengguna akhir yang lain sesuai dengan syarat-syarat dan ketentuan-ketentuan dari Lisensi ini. Hak-hak yang tidak diumumkan dilindungi berdasarkan undang-undang hak cipta Amerika Serikat.";
"Part43" = "10. Hukum yang Mengatur dan Keterpisahan. Lisensi ini akan diatur dengan dan ditafsirkan berdasarkan hukum Negara Bagian California, dengan mengecualikan prinsip-prinsip hukum perselisihannya. Lisensi ini tidak tunduk pada Konvensi Perserikatan Bangsa-Bangsa tentang Kontrak-Kontrak untuk Penjualan Barang-Barang secara Internasional, yang keberlakuannya dengan ini secara tegas dikecualikan. Jika anda seorang konsumen yang berdomisili di Inggris, Lisensi ini akan diatur berdasarkan hukum dari yurisdiksi domisili anda. Apabila dengan alasan apapun suatu pengadilan yang berwenang mendapatkan bahwa suatu ketentuan, atau bagian daripadanya, tidak dapat diberlakukan, semua ketentuan selebihnya dari Lisensi ini akan tetap berkekuatan dan berlaku sepenuhnya.  ";
"Part44" = "11. Perjanjian yang Lengkap; Bahasa yang Mengatur. Lisensi ini merupakan keseluruhan perjanjian antara anda dan Apple tentang Perangkat Lunak Apple, dan menggantikan semua pemahaman sebelumnya atau yang bersamaan mengenai hal tersebut. Setiap perubahan atau modifikasi atas Lisensi ini tidak akan mengikat kecuali dibuat secara tertulis dan ditandatangani oleh Apple. Terjemahan apapun dari Lisensi ini dibuat untuk memenuhi persyaratan setempat dan jika terjadi perselisihan antara naskah bahasa Inggris dan non-Inggrisnya, naskah bahasa Inggris Lisensi ini yang akan berlaku, sepanjang tidak dilarang oleh ketentuan hukum setempat di yurisdiksi anda.";
"Part45" = "12. Pengakuan-pengakuan Pihak Ketiga. Bagian-bagian dari Perangkat Lunak Apple mungkin menggunakan atau memuat perangkat lunak pihak ketiga atau materi berhak cipta lainnya. Pengakuan-pengakuan, ketentuan-ketentuan pemberian lisensi dan pernyataan-pernyataan tidak berlakunya jaminan-jaminan atas materi tersebut dimuat dalam dokumentasi elektronik untuk Perangkat Lunak Apple, dan penggunaan anda atas materi tersebut diatur oleh ketentuan masing-masing materi.";
"Part46" = "EA1576";
"Part47" = "16/08/2018";